app/controllers/communities_controller.rb

INSERT INTO "communities" ("created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-11-09 16:26:46.748222"], ["description", "hoa"], ["name", "hola"], ["updated_at", "2014-11-09 16:26:46.748222"]]
---
    def create
        @community = Community.new(community_params)

        @community.save

SELECT  "communities".* FROM "communities"  WHERE "communities"."id" = $1 LIMIT 1  [["id", 3]]
---
    def show
      @community = Community.find(params[:id])